heatTransfer/chtMultiRegionFoam/shellAndTubeHeatExchanger/0/shell/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0/shell";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform (0 0 0);

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    lower
    {
        type            pressureInletOutletVelocity;
        value           $internalField;
    }
    upper
    {
        type            flowRateInletVelocity;
        massFlowRate    constant 0.05;
        value           $internalField;
    }
    wall
    {
        type            noSlip;
    }
}

// ************************************************************************* //
